UECIDE-Cores/retrobsd/src/api/include/machine/pic32mx470.h
#define IEC(n)      PIC32_R (0x81060+((n)<<4))
#define IECCLR(n)   PIC32_R (0x81064+((n)<<4))
#define IECSET(n)   PIC32_R (0x81068+((n)<<4))
#define IECINV(n)   PIC32_R (0x8106C+((n)<<4))

#define IFS(n)      PIC32_R (0x81030+((n)<<4))
#define IFSCLR(n)   PIC32_R (0x81034+((n)<<4))
#define IFSSET(n)   PIC32_R (0x81038+((n)<<4))
#define IFSINV(n)   PIC32_R (0x8103C+((n)<<4))

#define IPC(n)      PIC32_R (0x81090+((n)<<4)) /* IPC(0..12) - Interrupt Priority Control */
#define IPCCLR(n)   PIC32_R (0x81094+((n)<<4))
#define IPCSET(n)   PIC32_R (0x81098+((n)<<4))
#define IPCINV(n)   PIC32_R (0x8109C+((n)<<4))


// Timers 1 through 5
#define T1CON       PIC32_R (0x00600)
#define TMR1        PIC32_R (0x00610)
#define PR1         PIC32_R (0x00620)
#define T2CON       PIC32_R (0x00800)
#define TMR2        PIC32_R (0x00810)
#define PR2         PIC32_R (0x00820)
#define T3CON       PIC32_R (0x00A00)
#define TMR3        PIC32_R (0x00A10)
#define PR3         PIC32_R (0x00A20)
#define T4CON       PIC32_R (0x00C00)
#define TMR4        PIC32_R (0x00C10)
#define PR4         PIC32_R (0x00C20)
#define T5CON       PIC32_R (0x00E00)
#define TMR5        PIC32_R (0x00E10)
#define PR5         PIC32_R (0x00E20)

// Input capture 1-5
#define IC1CON      PIC32_R (0x02000)
#define IC1BUF      PIC32_R (0x02020)
#define IC2CON      PIC32_R (0x02200)
#define IC2BUF      PIC32_R (0x02220)
#define IC3CON      PIC32_R (0x02400)
#define IC3BUF      PIC32_R (0x02420)
#define IC4CON      PIC32_R (0x02600)
#define IC4BUF      PIC32_R (0x02620)
#define IC5CON      PIC32_R (0x02800)
#define IC5BUF      PIC32_R (0x02820)

// Output compare 1-5
#define OC1CON      PIC32_R (0x03000)
#define OC1R        PIC32_R (0x03010)
#define OC1RS       PIC32_R (0x03020)
#define OC2CON      PIC32_R (0x03200)
#define OC2R        PIC32_R (0x03210)
#define OC2RS       PIC32_R (0x03220)
#define OC3CON      PIC32_R (0x03400)
#define OC3R        PIC32_R (0x03410)
#define OC3RS       PIC32_R (0x03420)
#define OC4CON      PIC32_R (0x03600)
#define OC4R        PIC32_R (0x03610)
#define OC4RS       PIC32_R (0x03620)
#define OC5CON      PIC32_R (0x03800)
#define OC5R        PIC32_R (0x03810)
#define OC5RS       PIC32_R (0x03820)

// I2C1
#define I2C1CON     PIC32_R (0x05000)
#define I2C1STAT    PIC32_R (0x05010)
#define I2C1ADD     PIC32_R (0x05020)
#define I2C1MSK     PIC32_R (0x05030)
#define I2C1BRG     PIC32_R (0x05040)
#define I2C1TRN     PIC32_R (0x05050)
#define I2C1RCV     PIC32_R (0x05060)

// I2C2
#define I2C2CON     PIC32_R (0x05100)
#define I2C2STAT    PIC32_R (0x05110)
#define I2C2ADD     PIC32_R (0x05120)
#define I2C2MSK     PIC32_R (0x05130)
#define I2C2BRG     PIC32_R (0x05140)
#define I2C2TRN     PIC32_R (0x05150)
#define I2C2RCV     PIC32_R (0x05160)

// UART 1
#define U1MODE      PIC32_R (0x06000)
#define U1STA       PIC32_R (0x06010)
#define U1TXREG     PIC32_R (0x06020)
#define U1RXREG     PIC32_R (0x06030)
#define U1BRG       PIC32_R (0x06040)

// UART 2
#define U2MODE      PIC32_R (0x06200)
#define U2STA       PIC32_R (0x06210)
#define U2TXREG     PIC32_R (0x06220)
#define U2RXREG     PIC32_R (0x06230)
#define U2BRG       PIC32_R (0x06240)

// UART 3
#define U3MODE      PIC32_R (0x06400)
#define U3STA       PIC32_R (0x06410)
#define U3TXREG     PIC32_R (0x06420)
#define U3RXREG     PIC32_R (0x06430)
#define U3BRG       PIC32_R (0x06440)

// UART 4
#define U4MODE      PIC32_R (0x06600)
#define U4STA       PIC32_R (0x06610)
#define U4TXREG     PIC32_R (0x06620)
#define U4RXREG     PIC32_R (0x06630)
#define U4BRG       PIC32_R (0x06640)

// UART 5
#define U5MODE      PIC32_R (0x06800)
#define U5STA       PIC32_R (0x06810)
#define U5TXREG     PIC32_R (0x06820)
#define U5RXREG     PIC32_R (0x06830)
#define U5BRG       PIC32_R (0x06840)

// SPI1
#define SPI1CON     PIC32_R (0x05800)
#define SPI1STAT    PIC32_R (0x05810)
#define SPI1BUF     PIC32_R (0x05820)
#define SPI1BRG     PIC32_R (0x05830)
#define SPI1CON2    PIC32_R (0x05840)

// SPI2
#define SPI2CON     PIC32_R (0x05A00)
#define SPI2STAT    PIC32_R (0x05A10)
#define SPI2BUF     PIC32_R (0x05A20)
#define SPI2BRG     PIC32_R (0x05A30)
#define SPI2CON2    PIC32_R (0x05A40)

// ADC
#define AD1CON1     PIC32_R (0x09000)
#define AD1CON2     PIC32_R (0x09010)
#define AD1CON3     PIC32_R (0x09020)
#define AD1CHS      PIC32_R (0x09040)
#define AD1CSSL     PIC32_R (0x09050)
#define AD1BUF0     PIC32_R (0x09070)
#define AD1BUF1     PIC32_R (0x09080)
#define AD1BUF2     PIC32_R (0x09090)
#define AD1BUF3     PIC32_R (0x090A0)
#define AD1BUF4     PIC32_R (0x090B0)
#define AD1BUF5     PIC32_R (0x090C0)
#define AD1BUF6     PIC32_R (0x090D0)
#define AD1BUF7     PIC32_R (0x090E0)
#define AD1BUF8     PIC32_R (0x090F0)
#define AD1BUF9     PIC32_R (0x09100)
#define AD1BUFA     PIC32_R (0x09110)
#define AD1BUFB     PIC32_R (0x09120)
#define AD1BUFC     PIC32_R (0x09130)
#define AD1BUFD     PIC32_R (0x09140)
#define AD1BUFE     PIC32_R (0x09150)
#define AD1BUFF     PIC32_R (0x09160)

// DMA Global
#define DMACON      PIC32_R (0x83000)
#define DMACONCLR   PIC32_R (0x83004)
#define DMACONSET   PIC32_R (0x83008)
#define DMACONINV   PIC32_R (0x8300C)
#define DMASTAT     PIC32_R (0x83010)
#define DMAADDR     PIC32_R (0x83020)

// DMA CRC
#define DCRCCON     PIC32_R (0x83030)
#define DCRCDATA    PIC32_R (0x83040)
#define DCRCXOR     PIC32_R (0x83050)

// DMA 0
#define DCH0CON     PIC32_R (0x83060)
#define DCH0ECON    PIC32_R (0x83070)
#define DCH0INT     PIC32_R (0x83080)
#define DCH0SSA     PIC32_R (0x83090)
#define DCH0DSA     PIC32_R (0x830A0)
#define DCH0SSIZ    PIC32_R (0x830B0)
#define DCH0DSIZ    PIC32_R (0x830C0)
#define DCH0SPTR    PIC32_R (0x830D0)
#define DCH0DPTR    PIC32_R (0x830E0)
#define DCH0CSIZ    PIC32_R (0x830F0)
#define DCH0CPTR    PIC32_R (0x83100)
#define DCH0DAT     PIC32_R (0x83110)

// DMA 1
#define DCH1CON     PIC32_R (0x83120)
#define DCH1ECON    PIC32_R (0x83130)
#define DCH1INT     PIC32_R (0x83140)
#define DCH1SSA     PIC32_R (0x83150)
#define DCH1DSA     PIC32_R (0x83160)
#define DCH1SSIZ    PIC32_R (0x83170)
#define DCH1DSIZ    PIC32_R (0x83180)
#define DCH1SPTR    PIC32_R (0x83190)
#define DCH1DPTR    PIC32_R (0x831A0)
#define DCH1CSIZ    PIC32_R (0x831B0)
#define DCH1CPTR    PIC32_R (0x831C0)
#define DCH1DAT     PIC32_R (0x831D0)

