UECIDE-Cores/retrobsd/src/api/include/machine/pic32mx470.h
// DMA 2
#define DCH2CON     PIC32_R (0x831E0)
#define DCH2ECON    PIC32_R (0x831F0)
#define DCH2INT     PIC32_R (0x83200)
#define DCH2SSA     PIC32_R (0x83210)
#define DCH2DSA     PIC32_R (0x83220)
#define DCH2SSIZ    PIC32_R (0x83230)
#define DCH2DSIZ    PIC32_R (0x83240)
#define DCH2SPTR    PIC32_R (0x83250)
#define DCH2DPTR    PIC32_R (0x83260)
#define DCH2CSIZ    PIC32_R (0x83270)
#define DCH2CPTR    PIC32_R (0x83280)
#define DCH2DAT     PIC32_R (0x83290)

// DMA 3
#define DCH3CON     PIC32_R (0x832A0)
#define DCH3ECON    PIC32_R (0x832B0)
#define DCH3INT     PIC32_R (0x832C0)
#define DCH3SSA     PIC32_R (0x832D0)
#define DCH3DSA     PIC32_R (0x832E0)
#define DCH3SSIZ    PIC32_R (0x832F0)
#define DCH3DSIZ    PIC32_R (0x83300)
#define DCH3SPTR    PIC32_R (0x83310)
#define DCH3DPTR    PIC32_R (0x83320)
#define DCH3CSIZ    PIC32_R (0x83330)
#define DCH3CPTR    PIC32_R (0x83340)
#define DCH3DAT     PIC32_R (0x83350)

// Comparator
#define CM1CON      PIC32_R (0x0A000)
#define CM2CON      PIC32_R (0x0A010)
#define CMSTAT      PIC32_R (0x0A060)

// Comparator voltage reference
#define CVRCON      PIC32_R (0x09800)

// Flash controller
#define NVMCON      PIC32_R (0x0F400)
#define NVMCONCLR   PIC32_R (0x0F404)
#define NVMCONSET   PIC32_R (0x0F408)
#define NVMCONINV   PIC32_R (0x0F40C)
#define NVMKEY      PIC32_R (0x0F410)
#define NVMADDR     PIC32_R (0x0F420)
#define NVMDATA     PIC32_R (0x0F430)
#define NVMSRCADDR  PIC32_R (0x0F440)

// System controller
#define OSCCON      PIC32_R (0x0F000)
#define OSCTUN      PIC32_R (0x0F010)
#define REFOCON     PIC32_R (0x0F020)
#define REFOTRIM    PIC32_R (0x0F030)
#define WDTCON      PIC32_R (0x00000)
#define RCON        PIC32_R (0x0F600)
#define RCONCLR     PIC32_R (0x0F604)
#define RCONSET     PIC32_R (0x0F608)
#define RCONINV     PIC32_R (0x0F60C)
#define RSWRST      PIC32_R (0x0F610)
#define RSWRSTCLR   PIC32_R (0x0F614)
#define RSWRSTSET   PIC32_R (0x0F618)
#define RSWRSTINV   PIC32_R (0x0F61C)
#define CFGCON      PIC32_R (0x0F200)
#define SYSKEY      PIC32_R (0x0F230)
#define PMD1        PIC32_R (0x0F240)
#define PMD2        PIC32_R (0x0F250)
#define PMD3        PIC32_R (0x0F260)
#define PMD4        PIC32_R (0x0F270)
#define PMD5        PIC32_R (0x0F280)
#define PMD66666    PIC32_R (0x0F290)

// Device configuration
#define DEVCFG0     *(volatile unsigned*)(0xBFC02FFC)
#define DEVCFG1     *(volatile unsigned*)(0xBFC02FF8)
#define DEVCFG2     *(volatile unsigned*)(0xBFC02FF4)
#define DEVCFG3     *(volatile unsigned*)(0xBFC02FF0)

// Device ID revision ID
#define DEVID       PIC32_R (0x0F220)

// PORT A
#define ANSELA      PIC32_R (0x86000)
#define TRISA       PIC32_R (0x86010)
#define PORTA       PIC32_R (0x86020)
#define LATA        PIC32_R (0x86030)
#define ODCA        PIC32_R (0x86040)
#define CNPUA       PIC32_R (0x86050)
#define CNPDA       PIC32_R (0x86060)
#define CNCONA      PIC32_R (0x86070)
#define CNENA       PIC32_R (0x86080)
#define CNSTATA     PIC32_R (0x86090)

// PORT B
#define ANSELB      PIC32_R (0x86100)
#define TRISB       PIC32_R (0x86110)
#define PORTB       PIC32_R (0x86120)
#define LATB        PIC32_R (0x86130)
#define ODCB        PIC32_R (0x86140)
#define CNPUB       PIC32_R (0x86150)
#define CNPDB       PIC32_R (0x86160)
#define CNCONB      PIC32_R (0x86170)
#define CNENB       PIC32_R (0x86180)
#define CNSTATB     PIC32_R (0x86190)

// PORT C
#define ANSELC      PIC32_R (0x86200)
#define TRISC       PIC32_R (0x86210)
#define PORTC       PIC32_R (0x86220)
#define LATC        PIC32_R (0x86230)
#define ODCC        PIC32_R (0x86240)
#define CNPUC       PIC32_R (0x86250)
#define CNPDC       PIC32_R (0x86260)
#define CNCONC      PIC32_R (0x86270)
#define CNENC       PIC32_R (0x86280)
#define CNSTATC     PIC32_R (0x86290)

// PORT D
#define ANSELD      PIC32_R (0x86300)
#define TRISD       PIC32_R (0x86310)
#define PORTD       PIC32_R (0x86320)
#define LATD        PIC32_R (0x86330)
#define ODCD        PIC32_R (0x86340)
#define CNPUD       PIC32_R (0x86350)
#define CNPDD       PIC32_R (0x86360)
#define CNCOND      PIC32_R (0x86370)
#define CNEND       PIC32_R (0x86380)
#define CNSTATD     PIC32_R (0x86390)

// PORT E
#define ANSELE      PIC32_R (0x86400)
#define TRISE       PIC32_R (0x86410)
#define PORTE       PIC32_R (0x86420)
#define LATE        PIC32_R (0x86430)
#define ODCE        PIC32_R (0x86440)
#define CNPUE       PIC32_R (0x86450)
#define CNPDE       PIC32_R (0x86460)
#define CNCONE      PIC32_R (0x86470)
#define CNENE       PIC32_R (0x86480)
#define CNSTATE     PIC32_R (0x86490)

// PORT F
#define ANSELF      PIC32_R (0x86500)
#define TRISF       PIC32_R (0x86510)
#define PORTF       PIC32_R (0x86520)
#define LATF        PIC32_R (0x86530)
#define ODCF        PIC32_R (0x86540)
#define CNPUF       PIC32_R (0x86550)
#define CNPDF       PIC32_R (0x86560)
#define CNCONF      PIC32_R (0x86570)
#define CNENF       PIC32_R (0x86580)
#define CNSTATF     PIC32_R (0x86590)

// PORT G
#define ANSELG      PIC32_R (0x86600)
#define TRISG       PIC32_R (0x86610)
#define PORTG       PIC32_R (0x86620)
#define LATG        PIC32_R (0x86630)
#define ODCG        PIC32_R (0x86640)
#define CNPUG       PIC32_R (0x86650)
#define CNPDG       PIC32_R (0x86660)
#define CNCONG      PIC32_R (0x86670)
#define CNENG       PIC32_R (0x86680)
#define CNSTATG     PIC32_R (0x86690)

// PPS Input Registers
#define INT1R       PIC32_R (0x0FA04)
#define INT2R       PIC32_R (0x0FA08)
#define INT3R       PIC32_R (0x0FA0C)
#define INT4R       PIC32_R (0x0FA10)
#define T2CKR       PIC32_R (0x0FA18)
#define T3CKR       PIC32_R (0x0FA1C)
#define T4CKR       PIC32_R (0x0FA20)
#define T5CKR       PIC32_R (0x0FA24)
#define IC1R        PIC32_R (0x0FA28)
#define IC2R        PIC32_R (0x0FA2C)
#define IC3R        PIC32_R (0x0FA30)
#define IC4R        PIC32_R (0x0FA34)
#define IC5R        PIC32_R (0x0FA38)
#define OCFAR       PIC32_R (0x0FA48)
#define U1RXR       PIC32_R (0x0FA50)
#define U1CTSR      PIC32_R (0x0FA54)
#define U2RXR       PIC32_R (0x0FA58)
#define U2CTSR      PIC32_R (0x0FA5C)
#define U3RXR       PIC32_R (0x0FA60)
#define U3CTSR      PIC32_R (0x0FA64)
#define U4RXR       PIC32_R (0x0FA68)
#define U4CTSR      PIC32_R (0x0FA6C)
#define U5RXR       PIC32_R (0x0FA70)
#define U5CTSR      PIC32_R (0x0FA74)
#define SDI1R       PIC32_R (0x0FA84)
#define SS1R        PIC32_R (0x0FA88)
#define SDI2R       PIC32_R (0x0FA90)
#define SS2R        PIC32_R (0x0FA94)
#define REFCLKIR    PIC32_R (0x0FAD0)

// PPS Output Registers
#define RPA14R      PIC32_R (0x0FB38)
#define RPA15R      PIC32_R (0x0FB3C)
#define RPB0R       PIC32_R (0x0FB40)
#define RPB1R       PIC32_R (0x0FB44)
#define RPB2R       PIC32_R (0x0FB48)
#define RPB3R       PIC32_R (0x0FB4C)
#define RPB5R       PIC32_R (0x0FB54)
#define RPB6R       PIC32_R (0x0FB58)
#define RPB7R       PIC32_R (0x0FB5C)
#define RPB8R       PIC32_R (0x0FB60)
#define RPB9R       PIC32_R (0x0FB64)
#define RPB10R      PIC32_R (0x0FB68)
#define RPB14R      PIC32_R (0x0FB78)
#define RPB15R      PIC32_R (0x0FB7C)
#define RPC1R       PIC32_R (0x0FB84)
#define RPC2R       PIC32_R (0x0FB88)
#define RPC3R       PIC32_R (0x0FB8C)
#define RPC4R       PIC32_R (0x0FB90)
#define RPC13R      PIC32_R (0x0FBB4)
#define RPC14R      PIC32_R (0x0FBB8)
#define RPD0R       PIC32_R (0x0FBC0)
#define RPD1R       PIC32_R (0x0FBC4)
#define RPD2R       PIC32_R (0x0FBC8)
#define RPD3R       PIC32_R (0x0FBCC)
#define RPD4R       PIC32_R (0x0FBD0)
#define RPD5R       PIC32_R (0x0FBD4)
#define RPD8R       PIC32_R (0x0FBE0)
#define RPD9R       PIC32_R (0x0FBE4)
#define RPD10R      PIC32_R (0x0FBE8)
#define RPD11R      PIC32_R (0x0FBEC)
#define RPD12R      PIC32_R (0x0FBF0)
#define RPD14R      PIC32_R (0x0FBF8)
#define RPD15R      PIC32_R (0x0FBFC)
#define RPE3R       PIC32_R (0x0FC0C)
#define RPE5R       PIC32_R (0x0FC14)
#define RPE8R       PIC32_R (0x0FC20)
#define RPE9R       PIC32_R (0x0FC24)
#define RPF0R       PIC32_R (0x0FC40)
#define RPF1R       PIC32_R (0x0FC44)
#define RPF2R       PIC32_R (0x0FC48)
#define RPF3R       PIC32_R (0x0FC4C)
#define RPF4R       PIC32_R (0x0FC50)
#define RPF5R       PIC32_R (0x0FC54)
#define RPF6R       PIC32_R (0x0FC58)
#define RPF8R       PIC32_R (0x0FC60)
#define RPF12R      PIC32_R (0x0FC70)
#define RPF13R      PIC32_R (0x0FC74)
#define RPG0R       PIC32_R (0x0FC80)
#define RPG1R       PIC32_R (0x0FC84)
#define RPG6R       PIC32_R (0x0FC98)
#define RPG7R       PIC32_R (0x0FC9C)
#define RPG8R       PIC32_R (0x0FCA0)
#define RPG9R       PIC32_R (0x0FCA4)

// Parallel Master Port
#define PMCON       PIC32_R (0x07000)
#define PMMODE      PIC32_R (0x07010)
#define PMADDR      PIC32_R (0x07020)
#define PMDOUT      PIC32_R (0x07030)
#define PMDIN       PIC32_R (0x07040)
#define PMAEN       PIC32_R (0x07050)
#define PMSTAT      PIC32_R (0x07060)

