UECIDE-Cores/retrobsd/src/api/include/machine/pic32mx470.h
// Prefetch 
#define CHECON      PIC32_R (0x84000)
#define CHECONCLR   PIC32_R (0x84004)
#define CHECONSET   PIC32_R (0x84008)
#define CHECONINV   PIC32_R (0x8400C)
#define CHEACC      PIC32_R (0x84010)
#define CHETAG      PIC32_R (0x84020)
#define CHEMSK      PIC32_R (0x84030)
#define CHEW0       PIC32_R (0x84040)
#define CHEW1       PIC32_R (0x84050)
#define CHEW2       PIC32_R (0x84060)
#define CHEW3       PIC32_R (0x84070)
#define CHELRU      PIC32_R (0x84080)
#define CHEHIT      PIC32_R (0x84090)
#define CHEMIS      PIC32_R (0x840A0)
#define CHEPFABT    PIC32_R (0x840C0)

// RTCC
#define RTCCON      PIC32_R (0x00200)
#define RTCALRM     PIC32_R (0x00210)
#define RTCTIME     PIC32_R (0x00220)
#define RTCDATE     PIC32_R (0x00230)
#define ALRMTIME    PIC32_R (0x00240)
#define ALRMDATE    PIC32_R (0x00250)

// CTMU
#define CTMUCON     PIC32_R (0x0A200)

// USB
#define U1OTGIR     PIC32_R (0x85040)
#define U1OTGIE     PIC32_R (0x85050)
#define U1OTGSTAT   PIC32_R (0x85060)
#define U1OTGCON    PIC32_R (0x85070)
#define U1PWRC      PIC32_R (0x85080)
#define U1IR        PIC32_R (0x85200)
#define U1IE        PIC32_R (0x85210)
#define U1EIR       PIC32_R (0x85220)
#define U1EIE       PIC32_R (0x85230)
#define U1STAT      PIC32_R (0x85240)
#define U1CON       PIC32_R (0x85250)
#define U1ADDR      PIC32_R (0x85260)
#define U1BDTP1     PIC32_R (0x85270)
#define U1FRML      PIC32_R (0x85280)
#define U1FRMH      PIC32_R (0x85290)
#define U1TOK       PIC32_R (0x852A0)
#define U1SOF       PIC32_R (0x852B0)
#define U1BDTP2     PIC32_R (0x852C0)
#define U1BDTP3     PIC32_R (0x852D0)
#define U1CNFG1     PIC32_R (0x852E0)
#define U1EP0       PIC32_R (0x85300)
#define U1EP1       PIC32_R (0x85310)
#define U1EP2       PIC32_R (0x85320)
#define U1EP3       PIC32_R (0x85330)
#define U1EP4       PIC32_R (0x85340)
#define U1EP5       PIC32_R (0x85350)
#define U1EP6       PIC32_R (0x85360)
#define U1EP7       PIC32_R (0x85370)
#define U1EP8       PIC32_R (0x85380)
#define U1EP9       PIC32_R (0x85390)
#define U1EP10      PIC32_R (0x853A0)
#define U1EP11      PIC32_R (0x853B0)
#define U1EP12      PIC32_R (0x853C0)
#define U1EP13      PIC32_R (0x853D0)
#define U1EP14      PIC32_R (0x853E0)
#define U1EP15      PIC32_R (0x853F0)
#define U1EP(n)     PIC32_R (0x85300 + (n << 4)) /* Endpoint control */

/*
 * USB Power control register.
 */
#define PIC32_U1PWRC_USBPWR 0x0001 /* USB operation enable */
#define PIC32_U1PWRC_USUSPEND   0x0002 /* USB suspend mode */
#define PIC32_U1PWRC_USLPGRD    0x0010 /* USB sleep entry guard */
#define PIC32_U1PWRC_UACTPND    0x0080 /* UAB activity pending */

/*
 * USB Pending interrupt register.
 * USB Interrupt enable register.
 */
#define PIC32_U1I_DETACH    0x0001 /* Detach (host mode) */
#define PIC32_U1I_URST      0x0001 /* USB reset (device mode) */
#define PIC32_U1I_UERR      0x0002 /* USB error condition */
#define PIC32_U1I_SOF       0x0004 /* SOF token  */
#define PIC32_U1I_TRN       0x0008 /* Token processing complete */
#define PIC32_U1I_IDLE      0x0010 /* Idle detect */
#define PIC32_U1I_RESUME    0x0020 /* Resume */
#define PIC32_U1I_ATTACH    0x0040 /* Peripheral attach */
#define PIC32_U1I_STALL     0x0080 /* STALL handshake */

/*
 * USB OTG interrupt flags register.
 * USB OTG interrupt enable register.
 */
#define PIC32_U1OTGI_VBUSVD 0x0001 /* A-device Vbus change */
#define PIC32_U1OTGI_SESEND 0x0004 /* B-device Vbus change */
#define PIC32_U1OTGI_SESVD  0x0008 /* Session valid change */
#define PIC32_U1OTGI_ACTV   0x0010 /* Bus activity indicator */
#define PIC32_U1OTGI_LSTATE 0x0020 /* Line state stable */
#define PIC32_U1OTGI_T1MSEC 0x0040 /* 1 millisecond timer expired */
#define PIC32_U1OTGI_ID     0x0080 /* ID state change */

#define PIC32_U1OTGSTAT_VBUSVD  0x0001 /*  */
#define PIC32_U1OTGSTAT_SESEND  0x0004 /*  */
#define PIC32_U1OTGSTAT_SESVD   0x0008 /*  */
#define PIC32_U1OTGSTAT_LSTATE  0x0020 /*  */
#define PIC32_U1OTGSTAT_ID  0x0080 /*  */

#define PIC32_U1OTGCON_VBUSDIS  0x0001 /*  */
#define PIC32_U1OTGCON_VBUSCHG  0x0002 /*  */
#define PIC32_U1OTGCON_OTGEN    0x0004 /*  */
#define PIC32_U1OTGCON_VBUSON   0x0008 /*  */
#define PIC32_U1OTGCON_DMPULDWN 0x0010 /*  */
#define PIC32_U1OTGCON_DPPULDWN 0x0020 /*  */
#define PIC32_U1OTGCON_DMPULUP  0x0040 /*  */
#define PIC32_U1OTGCON_DPPULUP  0x0080 /*  */

#define PIC32_U1EI_PID      0x0001 /*  */
#define PIC32_U1EI_CRC5     0x0002 /*  */
#define PIC32_U1EI_EOF      0x0002 /*  */
#define PIC32_U1EI_CRC16    0x0004 /*  */
#define PIC32_U1EI_DFN8     0x0008 /*  */
#define PIC32_U1EI_BTO      0x0010 /*  */
#define PIC32_U1EI_DMA      0x0020 /*  */
#define PIC32_U1EI_BMX      0x0040 /*  */
#define PIC32_U1EI_BTS      0x0080 /*  */

#define PIC32_U1STAT_PPBI   0x0004 /*  */
#define PIC32_U1STAT_DIR    0x0008 /*  */
#define PIC32_U1STAT_ENDPT(x)   (((x) >> 4) & 0xF) /*  */

#define PIC32_U1ADDR_DEVADDR    0x007F /*  */
#define PIC32_U1ADDR_USBADDR0   0x0001 /*  */
#define PIC32_U1ADDR_DEVADDR1   0x0002 /*  */
#define PIC32_U1ADDR_DEVADDR2   0x0004 /*  */
#define PIC32_U1ADDR_DEVADDR3   0x0008 /*  */
#define PIC32_U1ADDR_DEVADDR4   0x0010 /*  */
#define PIC32_U1ADDR_DEVADDR5   0x0020 /*  */
#define PIC32_U1ADDR_DEVADDR6   0x0040 /*  */
#define PIC32_U1ADDR_LSPDEN 0x0080 /*  */

#define PIC32_U1FRML_FRM0   0x0001 /*  */
#define PIC32_U1FRML_FRM1   0x0002 /*  */
#define PIC32_U1FRML_FRM2   0x0004 /*  */
#define PIC32_U1FRML_FRM3   0x0008 /*  */
#define PIC32_U1FRML_FRM4   0x0010 /*  */
#define PIC32_U1FRML_FRM5   0x0020 /*  */
#define PIC32_U1FRML_FRM6   0x0040 /*  */
#define PIC32_U1FRML_FRM7   0x0080 /*  */

#define PIC32_U1FRMH_FRM8   0x0001 /*  */
#define PIC32_U1FRMH_FRM9   0x0002 /*  */
#define PIC32_U1FRMH_FRM10  0x0004 /*  */

#define PIC32_U1TOK_EP0     0x0001 /*  */
#define PIC32_U1TOK_EP      0x000F /*  */
#define PIC32_U1TOK_EP1     0x0002 /*  */
#define PIC32_U1TOK_EP2     0x0004 /*  */
#define PIC32_U1TOK_EP3     0x0008 /*  */
#define PIC32_U1TOK_PID0    0x0010 /*  */
#define PIC32_U1TOK_PID     0x00F0 /*  */
#define PIC32_U1TOK_PID1    0x0020 /*  */
#define PIC32_U1TOK_PID2    0x0040 /*  */
#define PIC32_U1TOK_PID3    0x0080 /*  */

#define PIC32_U1CNFG1_USBSIDL   0x0010 /*  */
#define PIC32_U1CNFG1_USBFRZ    0x0020 /*  */
#define PIC32_U1CNFG1_UOEMON    0x0040 /*  */
#define PIC32_U1CNFG1_UTEYE 0x0080 /*  */

#define PIC32_U1EP_EPHSHK   0x0001 /*  */
#define PIC32_U1EP_EPSTALL  0x0002 /*  */
#define PIC32_U1EP_EPTXEN   0x0004 /*  */
#define PIC32_U1EP_EPRXEN   0x0008 /*  */
#define PIC32_U1EP_EPCONDIS 0x0010 /*  */
#define PIC32_U1EP_RETRYDIS 0x0040 /*  */
#define PIC32_U1EP_LSPD     0x0080 /*  */

/* DB status field values */
#define PIC32_DB_BSTALL     (1 << 2)
#define PIC32_DB_DTS        (1 << 3)
#define PIC32_DB_NINC       (1 << 4)
#define PIC32_DB_KEEP       (1 << 5)
#define PIC32_DB_DATA1      (1 << 6)
#define PIC32_DB_UOWN       (1 << 7)
#define PIC32_DB_GET_PID(x) (((x) >> 2) & 0xF)
#define PIC32_DB_SET_PID(x) (((x) & 0xF) << 2)
#define PIC32_DB_GET_COUNT(x)   (((x) >> 16) & 0x3FF)
#define PIC32_DB_SET_COUNT(x)   (((x) & 0x3FF) << 16)

